unload/cf/InformationRegisters/кб99_ОстаткиПартийВетис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>кб99_ОстаткиПартийВетис</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

unload/cf/InformationRegisters/кб99_ОстаткиПартийВетис/Ext/ManagerModule.bsl
Процедура ЗаписатьОстаткиПартий(СписокПартий, ДокСсылка) Экспорт

	тзПартии = Новый ТаблицаЗначений;
	тзПартии.Колонки.Добавить("Партия");
	тзПартии.Колонки.Добавить("Количество");
	
	Для Каждого стрПартия Из СписокПартий Цикл
		СтрТЧ = тзПартии.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ, стрПартия);
	КонецЦикла;
	
	тзПартии.Свернуть("Партия", "Количество");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Стр Из тзПартии Цикл
		
		МенеджерЗаписи = РегистрыСведений.кб99_ОстаткиПартийВетис.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Партия = Стр.Партия;
		МенеджерЗаписи.ДокументДвижения = ДокСсылка;
		МенеджерЗаписи.Количество = Стр.Количество;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
